<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
  <head>
  <meta http-equiv="content-type" content="text/html; charset=UTF-8"/>
  <title>Ehrenamtsatlas - Nutzungshinweise für Kiezatlas Neulinge</title>
    <link rel="stylesheet" type="text/css" href="land.css">
    <link rel="stylesheet" type="text/css" href="landhelp.css">
  </head>
  <body>
    <div id="kiezatlas">
      <div id="kaheader">
		    <div id="mapName">Bedienhinweise zum Ehrenamtsatlas</div>
      </div>
      <div id="helpContent">
        <p/>
        <b class="redTitle">Zur Orientierung in der Benutzeroberfl&auml;che</b>
        <p class="content">
          Der Ehrenamtsatlas teilt sich grundsätzlich in die <b>Kartenansicht</b> zur linken und in die am rechten Rand liegende, redaktionell betreute <b>Seitenleiste</b> auf. Des weiteren gibt es noch eine <b>Titelleiste</b> die sich &uuml;ber beide Elemente hinwegsetzt und das verbindende Element zur Kopfzeile der berlin.de Webseite darstellt.<br/>
          <br/>Diese beiden Bereiche der Anwendung reagieren jeweils unterschiedlich auf ihre Benutzereingaben und bieten zusammen eine sich erg&auml;nzende Funktionalit&auml;t an, die zum schnellen aufdecken von standortbasierten Informationen aus einem relativ gro&szlig;en Datenbestand optimiert ist. Die Seitenleiste beinhaltet ein <i>Kategoriesystem</i> und nach verschiedenen Benutzeranfragen auch eine <i>Ergebnisliste</i>.
          <br/>
          <a name="top">&nbsp;</a>
          <br/>F&uuml;r eine effiziente Benutzung dieser Anwendung sind hier folgende Funktionalit&auml;ten kurz erl&auml;utert. 
        </p>
        <b class="redTitle">Handhabung der verschiedenen Informationsebenen in der Seitenleiste</b>
        <p class="content">
          <b><a href="#layersClick">Kategorien ein- bzw. ausblenden:</a></b> Ein Klick auf das Symbol neben dem Namen der Kategorie blendet alle zugeordneten Elemente auf der Karte ein- bzw. aus.<br/>
          <b><a href="#critSearch">Elemente einer Kategorie auflisten:</a></b> Ein Klick auf den Namen der Kategorie, blendet <i>nur</i> alle zu dieser Kategorie zugeordneten Elemente auf der Karte ein und listet diese in der <i>Seitenleiste</i> auf.<br/>
          <b><a href="#critClick">Kategoriesystem / Kriterium wechseln:</a></b> Ein Klick auf z.B. "T&auml;tigkeit" in der <i>Seitenleiste</i> ganz oben, wechselt das Kriterium und bietet ihnen somit eine andere Sichtweise, also ein weiteres Kategoriesystem zum Datenbestand.<br/>
          <b><a href="#showItem">Elemente in der Ergebnisliste:</a></b> Ein Klick auf ein Element der <i>Ergebnisliste</i> in der <i>Seitenleiste</i> fokussiert den Kartenausschnit und hebt das dazugeh&ouml;rige Element auf der Karte hervor.<br/>
          
          <br/><b>Hinweis:</b> Die Seitenleiste kann zugunsten eines gr&ouml;&szlig;eren Kartenausschnitts mithilfe des blauen Balkens aus- und eingeblendet werden.
        </p>
        <b class="redTitle">Handhabung der Eingabefunktionalit&auml;t</b>
        <p class="content">
          <b><a href="#streetSearch">Stra&szlig;e in der Kartenansicht ansteuern:</a></b> Der Text im ersten, linken, Eingabefeld der <i>Titelleiste</i> veranlasst im Falle einer korrekten Berliner Anschrift die Fokussierung des Kartenausschnitts auf diesen Bereich.<br/>
          <b><a href="#nameSearch">Suche nach Name und Stra&szlig;enname einer Einsatzm&ouml;glichkeit:</a></b> Der Text im zweiten, rechten, Eingabefeld der <i>Titelleiste</i> veranlasst auf das drücken der RETURN-Taste eine Suche nach allen Einsatzm&ouml;glichkeiten die einen Teil des Textes im Stra&szlig;ennamen oder im Titel der Einsatzbeschreibung tragen.<br/>
        </p>
        <b class="redTitle">Steuerung der Kartenansicht</b>
        <p class="content">
          <b>Zoom:</b> Eine Maßstabsänderung des Kartenmaterials kann mind. bequem durch die Bewegung des Mausrads (falls vorhanden) oder auf ein Klick der Bedienelemente <b>+</b> und <b>-</b> am linken Rand der Karte ausgel&ouml;st werden.<br/>
          <b>Umherschweifen:</b> Eine Verschiebung des Kartenausschnitts steuern sie mittels einer Mausbewegung w&auml;hrend gleichzeitig die linke Maustaste gedr&uuml;ckt ist.<br/>
          <b><a href="#forthAndBack">Vor- und Zur&uuml;ck:</a></b> Alle Schritte die den Kartenausschnitt beeinflussen, lassen sich mit den beiden Bedienelementen am unteren linken Rand der Karte stets vor und zur&uuml;ck gehen. So lassen sich die Wege der angesteuerten Punkt in der Karte leicht nachvollziehen.<br/>
          <b><a href="#showDetails">Detailinformationen laden:</a></b> Ein Klick auf <i>weitere Details</i> l&auml;dt die wichtigsten Detailinformationen in die <i>Seitenleiste</i>.<br/>
          <b><a href="#clusterSelectItem"><i>Hotspots</i> benutzen:</a></b> Ein <i>Hotspot</i> vereint mehrere Elemente an einer Adresse und liefert bei Mausber&uuml;hrung ein Auswahlmen&uuml;.<br/>
        </p>
        <b class="redTitle">Zusatzfunktionalit&auml;t zur Kartenansicht</b>
        <p class="content">
          <b><a href="#mapFunctions">alle Markierer ein- bzw. ausblenden:</a></b> Einsatzm&ouml;glichkeiten alle Kategorien werden auf der Karte ein- bzw. ausgeblendet.<br/>
          <b><a href="#mapFunctions">offenes Kartenmaterial ausw&auml;hlen:</a></b> Alternativ zu dem Kartenmaterial von Google k&ouml;nn sie auch Kartenmaterial von OpenStreetMap unter der freundlicheren <a href="http://creativecommons.org/licenses/by-sa/2.0/">CC-BY-SA</a> Lizenz ausw&auml;hlen.<br/>
          <b><a href="#mapFunctions">Kartenausschnitt zur&uuml;cksetzen:</a></b> Dieser Hilfsknopf setzt den sichtbaren Kartenausschnitt auf die Ausgangsposition zur&uuml;ck<br/>
        </p>
       <hr>
        <a name="layersClick">&nbsp;</a>
        <br/><br/>
        <b class="darkTitle">
          <img title="Hier wurde gerade die Kategorie 'Aktionen im Kiez' eingeblendet." src="img/layerClicks-Small.png"><br/>
          Abb.1 zeigt das Klicken auf ein Icon einer Kategorie. <br/> Dieser veranlasst das Ein- und Ausblenden von angezeigten Kategorien in der <i>Seitenleiste</i>. &nbsp; &nbsp;<a class="back" href="#top">zur&uuml;ck nach Oben</a>
        </b>
        <p/>
        <a name="critSearch"> &nbsp; </a>
                  <br/>
          <b class="darkTitle">
          <img title="Hier wurden gerade alle Elemente einer Kategorie eingeblendet und in der Seitenleiste aufgelistet." src="img/SideBarCatSearchClickTwo700.png">
          <br/>
          Abb.2a zeigt das Ergebnis nach einem Klick auf den Namen einer Kategorie. <br/> Dieser veranlasst das Suchen nach allen Elementen einer bestimmten Kategorie in der <i>Seitenleiste</i>. &nbsp; &nbsp; <a class="back" href="#top">zur&uuml;ck nach Oben</a>
        </b>
        <p/>
        <a name="showItem">&nbsp;</a><br/>
        <b class="darkTitle">
          <img src="img/listClick2b.png"><br/>
          Abb.2b zeigt wie ein Klick auf ein Eintrag in der Liste das dementsprechende Element auf der Karte ansteuert und hervorhebt. &nbsp; &nbsp; <a class="back" href="#top">zur&uuml;ck nach Oben</a>
        </b><br/>
        <p/>
        <a name="critClick">
          <b class="darkTitle">
          </a><br/><br/>
        <img title="Hier wird gerade ein neues Kriterium angew&auml;hlt." src="img/critClick-Small.png"><br/>
        Abb.3 zeigt ein Klick auf das wechseln des Kategoriesystems oben rechts in der <i>Seitenleiste</i>. &nbsp; &nbsp; <a class="back" href="#top">zur&uuml;ck nach Oben</a>
        </b>
        <p/>
        <a name="streetSearch">
          <b class="darkTitle">
          </a><br/><br/>
        <img title="Hier wurde gerade mit 'ENTER' ein Haus in der Gustav-Adolf Straße angesteuert." src="img/streetSearch-small.png"><br/>
        Abb.4 zeigt die Eingabe eines Straßennamens in die <i>Titelleiste</i> und die anschlie&szlig;ende Fokussierung der Kartenansicht auf das Ergebnis. <br/>Erst das dr&uuml;cken der ENTER-Taste l&ouml;st die Suchanfrage aus. &nbsp; &nbsp; <a class="back" href="#top">zur&uuml;ck nach Oben</a>
        </b>
        <p/>
        <a name="nameSearch">
          <b class="darkTitle">
          </a><br/><br/>
        <img title="Hier wird gerade ein neues Kriterium angew&auml;hlt." src="img/searchByName-small.png"><br/>
        Abb.5 zeigt die Eingabe einer Suchanfrage bei der nach allen Einsatzm&ouml;glichkeiten die die Zeichen "Hausaufgaben" im Namen oder in der Anschrift tragen. <br/>Auch hier l&ouml;st erst das dr&uuml;cken der ENTER-Taste die Suchanfrage aus. &nbsp; &nbsp; <a class="back" href="#top">zur&uuml;ck nach Oben</a>
        </b><p/>
        <a name="forthAndBack"><b class="darkTitle">
          </a><br/><br/>
          <img title="Vor und Zur&uuml;ck" src="img/forthAndBack-Small.png"><br/>
          Abb.6a zeigt welche Bedienelemente erm&ouml;glichen das Vor- und Zur&uuml;ck springen zwischen bereits angesteuerten Kartenausschnitten erm&ouml;glichen. &nbsp; &nbsp; <a class="back" href="#top">zur&uuml;ck nach Oben</a>
          </b>
        <p/>
        <a name="showDetails">&nbsp;</a><br/>
        <b class="darkTitle">
          <img src="img/detailsClick2c.png"><br/>
          Abb.6b zeigt wie zu einer hervorgehobenen Einsatzm&ouml;glichkeit weitere Detailinformationen in die Seitenleiste geladen werden k&ouml;nnen.  &nbsp; &nbsp; <a class="back" href="#top">zur&uuml;ck nach Oben</a>
        </b><br/>
        <p/>
        <a name="clusterSelectItem">&nbsp;</a><br/>
        <b class="darkTitle">
          <img src="img/selectItemFromCluster-small.png"><br/>
          Abb.6c zeigt einen sog. <i>Hotspot</i> und ein dazugeh&ouml;riges Auswahlmen&uuml;. Wenn bereits ein Element eines Hotspots hervorgehoben ist, kann es zu leichten Schwierigkeiten bei der Benutzung kommen wobei ein einmaliger Klick<br/> ins Leere der <i>Kartenansicht</i> oder auf eine anderes sichtbares Element auf der Karte beseitigt diesen kleinen Umstand. <br/>Hotspots stellen mehrere Einsatzm&ouml;glichkeiten an einer Adresse dar und werden daher auf der Kartenansicht ein klein wenig gr&ouml;&szlig;er dargestellt.
          </b>
        <p/>
        <a name="mapFunctions"><b class="darkTitle">
          </a><br/><br/>
          <img title="Extra Funktionalit&auml;t zur Kartenansicht" src="img/extraMapFunctions-small.png"><br/>
          Abb.7 zeigt welche Bedienelemente den Zugang zur Zusatzfunktionalit&auml;t der <i>Kartenansicht</i> bieten. &nbsp; &nbsp; <a class="back" href="#top">zur&uuml;ck nach Oben</a>
          </b>
        <p/>
        <a name="fullOpenScreen"><b class="darkTitle">
          </a><br/><br/>
          <img title="Open Streetmap Fullscreen" src="img/fullScreenshot-700.png">
          <br/>Abb.8 zeigt den Ehrenamtsatlas unter Verwendnung von offenem Kartenmaterial. &nbsp; &nbsp; <a class="back" href="#top">zur&uuml;ck nach Oben</a>
          </b>
        <p/>&nbsp;<p/>
        <b class="darkTitle">
        Bei weiteren Fragen oder falls sie uns wertvolles Nutzerfeedback senden k&ouml;nnen freue ich mich auf ihre Nachricht.
        <p/>
        Der Autor Malte Rei&szlig;ig (<a href="mailto:mre@deepamehta.de">Mailbox</a>) hat diese Seite zuletzt am 5.Juli 2010 aktualisiert.</b>
        </p>
        <div id="kafooter">
          <a href="http://www.berlin.de/buergeraktiv/">Impressum</a> und <a href="http://www.kiezatlas.de">Haftungshinweise</a><b> powered by <a href="http://www.deepamehta.de">DeepaMehta</a></b>
        </div>
        <p/>&nbsp;<p/>
      </div>
    </div>
  </body>
</html>
